{"count":32,"results":[{"feedback_id":417393950,"creation_tsz":1604507263,"message":"Quality is great! The graphic is so adorable! Just as pictured, if not better. Tiago was very quick to respond to messages, and actually added a crewneck option at my request. Would absolutely recommend this shop!","value":1},{"feedback_id":412854691,"creation_tsz":1602633376,"message":"Daughter is in love with this design.","value":1},{"feedback_id":403452766,"creation_tsz":1598883336,"message":"How cute is this hoodie!  Great quality same as the other 2 I purchased, and super soft.  Really happy with this shop for continuing to come up with unique ideas!","value":1},{"feedback_id":402367962,"creation_tsz":1598445594,"message":"We love these hoodies, they are great quality and I would recommend them to my friends.","value":1},{"feedback_id":402367816,"creation_tsz":1598445553,"message":"So cute, and great quality hoodies.  Would recommend and would buy again!","value":1},{"feedback_id":402416725,"creation_tsz":1598406407,"message":"This was a gift for my S\/O - he loves it!","value":1},{"feedback_id":397990425,"creation_tsz":1596745914,"message":"Very cute and super soft.","value":1},{"feedback_id":393966230,"creation_tsz":1595332519,"message":"Runs very very small. I ordered an XL and it’s very tight.","value":0},{"feedback_id":393098488,"creation_tsz":1594988586,"message":"Viel zu Groß, Rücknahme gab e nicht.","value":-1},{"feedback_id":393195529,"creation_tsz":1594988514,"message":"Viel zu Groß, Rücknahme gab e nicht.","value":-1},{"feedback_id":389962738,"creation_tsz":1593769159,"message":"Guys, I am literally in love with my new sushi tank! It’s very comfortable, the size is good and the midnight navy color is exactly as I expected! I’ve washed it already 3 times in the machine without any problems. If you are a sushi lover like me, go ahead and by any of their item without thinking twice 😉\nThank you Cutteeness for your great support and amazing design!","value":1},{"feedback_id":385088229,"creation_tsz":1591903342,"message":"It’s a great Tee shirt, but after 2 washes the print has noticeably faded unfortunately. And it was pretty expensive having it shipped to Canada.","value":0},{"feedback_id":384924106,"creation_tsz":1591886859,"message":"LOVE it !!!!!!!!!!!!!!! I definitively recommand it. Size is good and material is good quality too.","value":1},{"feedback_id":383778001,"creation_tsz":1591408334,"message":"Love the sushi hug T-shirts. Good quality and adorable design.","value":1},{"feedback_id":381094292,"creation_tsz":1590582828,"message":"Absolutely adorable! The order arrived really quickly, and the owner was nothing short of friendly and helpful! 10\/10 would shop again 💓","value":1},{"feedback_id":378613941,"creation_tsz":1589656371,"message":"Loved the fabric and the shirt is super cute, but I should have ordered one size bigger for me. I am more on the curvy side and prefer a bit more loose fit. But that’s just preference.","value":1},{"feedback_id":378528138,"creation_tsz":1589656062,"message":"Super cute! Great fabric! My baby is 3 months and a bit chunky, so I ordered 6 months and it’s not big, just perfect. I also bought a shirt for me with the same picture!","value":1},{"feedback_id":375441633,"creation_tsz":1588492520,"message":"Lovely design and great product. We love it! \nAlso customer service is absolutely fantastic! Tiago answered all questions quickly, helped me with the tracking and confirmed the arrival with me after I recieved the package. \nGreat value and service all around. I&#39;m just waiting for the next opportunity to order again. :)","value":1},{"feedback_id":375224323,"creation_tsz":1588387665,"message":null,"value":1},{"feedback_id":375224295,"creation_tsz":1588387650,"message":null,"value":1},{"feedback_id":375143164,"creation_tsz":1588387614,"message":"Cuter than what expected!!  Absolutely love it!!","value":1},{"feedback_id":374892822,"creation_tsz":1588287450,"message":"Tiago&#39;s work is amazing and he stands behind his product. I&#39;ll be adding more of his designs to my wardrobe soon!","value":1},{"feedback_id":373945836,"creation_tsz":1587922382,"message":"Perfect fit t-shirt, fun illustration, very soft and comfortable fabric.","value":1},{"feedback_id":373925216,"creation_tsz":1587914307,"message":"As a Culinary instructor the sushi caught my eye. One of my favorite classes to teach is my sushi class. Love this design and can&#39;t wait to see more!","value":1},{"feedback_id":374003065,"creation_tsz":1587914184,"message":"I love this design. I&#39;m in San Antonio, TX and this image was calling out to me. The fabric is very soft and comparable to big name retailers such as Zara or American Express. Tiago&#39;s customer service from start to delivery was amazing and is something others should strive to do cause it made me feel special. I will definitely make more purchases in the future!","value":1}],"params":{"user_id":"lyxngoap","limit":25,"offset":0,"page":null},"type":"Feedback","pagination":{"effective_limit":25,"effective_offset":0,"next_offset":25,"effective_page":1,"next_page":2}}